Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::PipeBranchPreferenceTable Class Referencefinal
MEP Element Manager
The PipeBranchPreferenceTable contains cross section and geometry related information for Pipe branches. More...
#include <MEPPipeBranchPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::PipeBranchPreferenceTable:
 Classes
struct  | Key
The key that uniquely identifies a row in the PipeBranchPreferenceTable. More...
class  | Modifier
Modifier of the PipeBranchPreferenceTable. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetMainAxisReferenceId (uint32_t index) const
Result< double >  | GetBranchAxisAngle (uint32_t index) const
Result< uint32_t >  | GetBranchAxisReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if both diameters, the length, the branchOffset and the connectionLength contains non-zero values, description is optional.
Result< bool >  | IsRowValidByKey (const Key &key) const
A row is considered valid if both diameters, the length, the branchOffset and the connectionLength contains non-zero values, description is optional.
Result< double >  | GetMainAxisDiameter (uint32_t index) const
Result< double >  | GetMainAxisDiameterByKey (const Key &key) const
Result< double >  | GetBranchAxisDiameter (uint32_t index) const
Result< double >  | GetBranchAxisDiameterByKey (const Key &key) const
Result< double >  | GetLength (uint32_t index) const
Result< double >  | GetLengthByKey (const Key &key) const
Result< double >  | GetBranchOffset (uint32_t index) const
Result< double >  | GetBranchOffsetByKey (const Key &key) const
Result< double >  | GetConnectionLength (uint32_t index) const
Result< double >  | GetConnectionLengthByKey (const Key &key) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByKey (const Key &key) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipeBranchPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a PipeBranchPreferenceTable.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipeBranchPreferenceTable contains cross section and geometry related information for Pipe branches.
Since
Archicad 28
The table uses the keys defined by the PipeReferenceSet and PipeAngleSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& pipeBranchTableId : pipeBranchTableIds) {
 ACAPI::Result<PipeBranchPreferenceTable> pipeBranchTable = PipeBranchPreferenceTable::Get (pipeBranchTableId);
 if (pipeBranchTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", pipeBranchTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < pipeBranchTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Main Axis ReferenceId", *pipeBranchTable->GetMainAxisReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Axis Angle", *pipeBranchTable->GetBranchAxisAngle (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Axis ReferenceId", *pipeBranchTable->GetBranchAxisReferenceId (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Main Axis Diameter", *pipeBranchTable->GetMainAxisDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Axis Diameter", *pipeBranchTable->GetBranchAxisDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Length", *pipeBranchTable->GetLength (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Offset", *pipeBranchTable->GetBranchOffset (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Connection Length", *pipeBranchTable->GetConnectionLength (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *pipeBranchTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*pipeBranchTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification
 for (const UniqueID& pipeBranchTableId : pipeBranchTableIds) {
 ACAPI::Result<PipeBranchPreferenceTable> pipeBranchTable = PipeBranchPreferenceTable::Get (pipeBranchTableId);
 if (pipeBranchTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", pipeBranchTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < pipeBranchTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Main Axis ReferenceId", *pipeBranchTable->GetMainAxisReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Axis Angle", *pipeBranchTable->GetBranchAxisAngle (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Axis ReferenceId", *pipeBranchTable->GetBranchAxisReferenceId (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Main Axis Diameter", *pipeBranchTable->GetMainAxisDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Axis Diameter", *pipeBranchTable->GetBranchAxisDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Length", *pipeBranchTable->GetLength (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Branch Offset", *pipeBranchTable->GetBranchOffset (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Connection Length", *pipeBranchTable->GetConnectionLength (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *pipeBranchTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*pipeBranchTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::PipeBranchPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< PipeBranchPreferenceTable > ACAPI::MEP::PipeBranchPreferenceTable::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a PipeBranchPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested PipeBranchPreferenceTable.
Returns
If the uniqueId belongs to a PipeBranchPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetBranchAxisAngle()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetBranchAxisAngle  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the branch axis angle of the table's row.
◆ GetBranchAxisDiameter()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetBranchAxisDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the branch axis diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBranchAxisDiameterByKey()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetBranchAxisDiameterByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the branch axis diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBranchAxisReferenceId()
 Result< uint32_t > ACAPI::MEP::PipeBranchPreferenceTable::GetBranchAxisReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the branch axis referenceId of the table's row.
◆ GetBranchOffset()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetBranchOffset  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the branch offset value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBranchOffsetByKey()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetBranchOffsetByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the branch offset value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetConnectionLength()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetConnectionLength  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the connection length value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetConnectionLengthByKey()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetConnectionLengthByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the connection length value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::PipeBranchPreferenceTable::GetDescription  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByKey()
 Result< GS::UniString > ACAPI::MEP::PipeBranchPreferenceTable::GetDescriptionByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the description of the table's row.
◆ GetLength()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetLength  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the length value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetLengthByKey()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetLengthByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the length value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetMainAxisDiameter()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetMainAxisDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the main axis diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetMainAxisDiameterByKey()
 Result< double > ACAPI::MEP::PipeBranchPreferenceTable::GetMainAxisDiameterByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the main axis diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetMainAxisReferenceId()
 Result< uint32_t > ACAPI::MEP::PipeBranchPreferenceTable::GetMainAxisReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the main axis referenceId of the table's row.
◆ GetName()
 GS::UniString ACAPI::MEP::PipeBranchPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 uint32_t ACAPI::MEP::PipeBranchPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::PipeBranchPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::PipeBranchPreferenceTable::IsRowValid  |  ( |  uint32_t |  index | ) |   const
A row is considered valid if both diameters, the length, the branchOffset and the connectionLength contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByKey()
 Result< bool > ACAPI::MEP::PipeBranchPreferenceTable::IsRowValidByKey  |  ( |  const Key & |  key | ) |   const
A row is considered valid if both diameters, the length, the branchOffset and the connectionLength contains non-zero values, description is optional.
Parameters
key | The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the validity state of the row.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::PipeBranchPreferenceTable::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.